{"id":209,"date":"2019-02-01T10:30:53","date_gmt":"2019-02-01T10:30:53","guid":{"rendered":"https:\/\/domyassignments.com\/blog\/?p=209"},"modified":"2019-02-01T10:31:41","modified_gmt":"2019-02-01T10:31:41","slug":"7-motivational-quotes-to-make-progress-in-new-year","status":"publish","type":"post","link":"https:\/\/domyassignments.com\/blog\/7-motivational-quotes-to-make-progress-in-new-year\/","title":{"rendered":"7 Motivational Quotes to Make Progress in 2019"},"content":{"rendered":"<p><img loading=\"lazy\" decoding=\"async\" src=\"https:\/\/domyassignments.com\/blog\/wp-content\/uploads\/2019\/02\/7-Inspirational-Quotes-to-Motivate-Yourself.png\" alt=\"7 Inspirational Quotes to Motivate Yourself\" width=\"960\" height=\"640\" class=\"alignnone size-full wp-image-221\" srcset=\"https:\/\/domyassignments.com\/blog\/wp-content\/uploads\/2019\/02\/7-Inspirational-Quotes-to-Motivate-Yourself.png 960w, https:\/\/domyassignments.com\/blog\/wp-content\/uploads\/2019\/02\/7-Inspirational-Quotes-to-Motivate-Yourself-300x200.png 300w, https:\/\/domyassignments.com\/blog\/wp-content\/uploads\/2019\/02\/7-Inspirational-Quotes-to-Motivate-Yourself-768x512.png 768w\" sizes=\"(max-width: 960px) 100vw, 960px\" \/><\/p>\n<p dir=\"ltr\">So, the 2018 year is drawing to a close, and now, it is a good time to reflect on what it has been like as well as what you would like the following year to be in terms of academic success, private achievements, and professional development. Did you manage to do everything you wanted to do this year? Were you able to fulfill your dreams? Was it a good year? Whether it was or not, it is high time to think of some ways to make sure the next year is going to be better in all respects.<\/p>\n<p><!--more--><\/p>\n<p>In this article, you&rsquo;ll get familiar with the best motivational quotes to get you started and keep you going for the entire year &ndash; so, read on and recharge yourself with energy to achieve everything you desire.<\/p>\n<h2 dir=\"ltr\"><span style=\"background-color:#f1c40f\">&ldquo;A dream doesn&#39;t become reality through magic; it takes sweat, determination, and hard work&rdquo;<\/span><\/h2>\n<h2 dir=\"ltr\" style=\"text-align:right\"><em>Colin Powell<\/em><\/h2>\n<p dir=\"ltr\">At a glance, this idea doesn&rsquo;t do a very good job of psyching one up for an exciting and successful year. After all, wouldn&rsquo;t it be nice if we were able to achieve our dreams by merely wishing them to become true? However, there is another way to think about it all. Consider this: have all the successful people achieved what they have not through blind luck but via consistent and constant application of time and efforts? This means there is no such thing as pre-determined success or failure. You may feel down right now, you may think that you are by definition unable to achieve what you desire. But if you take this quote to heart, this will mean that there is no such thing as an unsalvageable situation. By applying yourself, you can achieve anything &ndash; just don&rsquo;t give up too soon.<\/p>\n<h2 dir=\"ltr\"><span style=\"background-color:#2ecc71\">&ldquo;It doesn&rsquo;t matter where you came from. All that matters is where you are going&rdquo;<\/span><\/h2>\n<h2 dir=\"ltr\" style=\"text-align:right\"><em>Brian Tracy<\/em><\/h2>\n<p dir=\"ltr\">So what if the last year wasn&rsquo;t as successful and exciting as you wanted it to be? When it comes to achievements, what you were able to do in the past doesn&rsquo;t have to determine what you will do in the future. Even if you spend an inordinate amount of time working and struggling with yourself for meager returns, things don&rsquo;t have to always be this way. If you really set a goal for yourself and really put every effort into achieving it, you will be able to do it, even if you don&rsquo;t have a long history of success.<\/p>\n<h2 dir=\"ltr\"><span style=\"background-color:#cc99ff\">&ldquo;Write it on your heart that every day is the best day of the year&rdquo;<\/span><\/h2>\n<h2 dir=\"ltr\" style=\"text-align:right\"><em>Ralph Waldo Emerson<\/em><\/h2>\n<p dir=\"ltr\">The 1st of January may be a traditional day for the new beginnings and making new year resolutions, but you don&rsquo;t have to wait for any specific date to start changing your life. There will never be a better day than today &ndash; both a better day in general and a better day to do something. Don&rsquo;t wait! Feel happiness now, don&rsquo;t put things off. Don&rsquo;t wait for a better time to start something. In some way, every day of your life is the best &ndash; so make sure to find what makes it so.<\/p>\n<h2 dir=\"ltr\"><span style=\"background-color:#ccff00\">&ldquo;Resolve to keep happy, and your joy and you shall form an invincible host against difficulties&rdquo;<\/span><\/h2>\n<h2 dir=\"ltr\" style=\"text-align:right\"><em>Helen Keller<\/em><\/h2>\n<p dir=\"ltr\">Being happy may be difficult, especially if there is nothing to be happy about in your life. However, it works both ways. If you meticulously look for reasons to be happy instead of reasons to feel down (like most of us do), you will find them. Most things we encounter aren&rsquo;t necessarily black or white &ndash; it depends on how we decide to look at them. If you make it your purpose in life to be happy and use every opportunity to be so, you will find that there is more happiness to go around than you could have ever believed. And being happy will make you more resilient against all the bad things that life throws your way.<\/p>\n<h2 dir=\"ltr\"><span style=\"background-color:#00ccff\">&ldquo;All of us every single year, we&rsquo;re a different person. I don&rsquo;t think we are the same person all our lives&rdquo;<\/span><\/h2>\n<h2 dir=\"ltr\" style=\"text-align:right\"><em>Steven Spielberg<\/em><\/h2>\n<p dir=\"ltr\">And if it is so, then stepping into the next year is an excellent reason to become a different, better person than you were last year. Who you are isn&rsquo;t set in stone anywhere &ndash; tomorrow, you don&rsquo;t have to have all the faults you had yesterday. It is in your power to change things and to change yourself &ndash; if you decide so.<\/p>\n<h2 dir=\"ltr\"><span style=\"background-color:#ff9999\">&ldquo;Whatever you do or dream you can do &ndash; begin it. Boldness has genius and power and magic in it&rdquo;<\/span><\/h2>\n<h2 dir=\"ltr\" style=\"text-align:right\"><em>Johann Wolfgang von Goethe<\/em><\/h2>\n<p dir=\"ltr\">It doesn&rsquo;t matter if you haven&rsquo;t done anything like this in the past &ndash; everything has to be done for the first time. Remember that nobody ever regrets having tried to do something. What people usually regret is not having tried. It doesn&rsquo;t matter even if you succeed or fail. If you try something new and succeed, good for you! You achieve what you want! If you try something new and fail, good for you as well! You receive valuable experience and will do better next time.<\/p>\n<h2 dir=\"ltr\"><span style=\"background-color:#99cccc\">&ldquo;A person who never made a mistake never tried anything new&rdquo;<\/span><\/h2>\n<h2 dir=\"ltr\" style=\"text-align:right\"><em>Albert Einstein<\/em><\/h2>\n<p dir=\"ltr\">Don&rsquo;t be afraid of making mistakes. The only person who never makes mistakes is the one who never does anything and never achieves anything in life. If you don&rsquo;t want to end up like this, be ready to go out of your comfort zone and do things that are new and unfamiliar to you. You will certainly end up making some blunders to begin with, but it is the only way to learn and get better. The less you are afraid of mistakes, the more interesting, full and enjoyable your life will become. So make sure you feel positive about them!<\/p>\n<p>When you think about the year that is about to pass and the coming one, it is important not to just reflect on them but to express your thoughts in a more material form &ndash; for example, in writing. It is often said that your thoughts don&rsquo;t actually become real until you write them down. You can think about something for as long as you like. But if you want your thoughts to actually have some impact on your life, you have to put them on paper. That is why it is so important to signify the end and the beginning of the year by taking some time to get your thoughts into order. Write on the topics that will help you understand better what you did over the past year and what you want to do over the one that comes after it. Some of the topics you may consider are:<\/p>\n<ul>\n<li dir=\"ltr\">\n<p dir=\"ltr\">For me, 2018 was the year of &hellip;;<\/p>\n<\/li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">I want 2019 to be the year of &hellip;;<\/p>\n<\/li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">How can I improve my life in 2019;<\/p>\n<\/li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">If I could make one my wish come true in 2019, what would it be?<\/p>\n<\/li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">What was my favorite part of 2018?<\/p>\n<\/li>\n<\/ul>\n<p dir=\"ltr\">We hope that after reading this, it will be easier for you to feel excited about the new year and prepare yourself for all kinds of new achievements, academic and otherwise!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>So, the 2018 year is drawing to a close, and now, it is a good time to reflect on what it has been like as well as what you would like the following year to be in terms of academic success, private achievements, and professional development. Did you manage to do everything you wanted to&#8230; <span class=\"continue-reading\"> <a href=\"https:\/\/domyassignments.com\/blog\/7-motivational-quotes-to-make-progress-in-new-year\/\" class=\"btn-content btn-more\">Read more<\/a><\/span><\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[5],"tags":[],"_links":{"self":[{"href":"https:\/\/domyassignments.com\/blog\/wp-json\/wp\/v2\/posts\/209"}],"collection":[{"href":"https:\/\/domyassignments.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/domyassignments.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/domyassignments.com\/blog\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/domyassignments.com\/blog\/wp-json\/wp\/v2\/comments?post=209"}],"version-history":[{"count":7,"href":"https:\/\/domyassignments.com\/blog\/wp-json\/wp\/v2\/posts\/209\/revisions"}],"predecessor-version":[{"id":225,"href":"https:\/\/domyassignments.com\/blog\/wp-json\/wp\/v2\/posts\/209\/revisions\/225"}],"wp:attachment":[{"href":"https:\/\/domyassignments.com\/blog\/wp-json\/wp\/v2\/media?parent=209"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/domyassignments.com\/blog\/wp-json\/wp\/v2\/categories?post=209"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/domyassignments.com\/blog\/wp-json\/wp\/v2\/tags?post=209"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}